# ExtendBelowBaseGreaterThanRunTopElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ExtendBelowBaseGreaterThanRunTopElevation Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Extend Below Base needs to be less than Run Top Elevation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtendBelowBaseGreaterThanRunTopElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtendBelowBaseGreaterThanRunTopElevation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtendBelowBaseGreaterThanRunTopElevation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace